Revit 2027 API
WireSet.Insert Method
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Insert(
	Wire item
)
Public Overridable Function Insert (
	item As Wire
) As Boolean
public:
virtual bool Insert(
	Wire^ item
)
abstract Insert :
        item : Wire -> bool
override Insert :
        item : Wire -> bool
Parameters
item Wire
Return Value
Boolean
See Also
Reference
WireSet Class
Autodesk.Revit.DB.Electrical Namespace